# Introduction to Groupby

## Notebook Outline
* <a href='#IntroToGroupby'>Introduction to Groupby</a>
* <a href='#simplegroupstats'>Calculating Simple Statistics on Groups</a>
* <a href='#agg'>Calculating Statistics on Multiple Columns in Groups, using .agg()</a>

In [1]:
import pandas as pd
import os

# Introduction to Groupby

The groupby method allows to group data in a dataframe by one or more columns to create a 'groupby object'. We can then analyze each of the groups to create per-group-statistics and analysis.  For example, the mean temperature per month (this involves grouping by the month) or the total sales per shift manager (this involves grouping by the manager). Let's look at some examples!

<https://pandas.pydata.org/pandas-docs/stable/groupby.html>

In [2]:
filepath = os.path.join(os.getcwd(), 'data', 'Philadelphia_Pennsylvania_USA/724080-13739-2001')

headers = ['Year', 'Month', 'Day', 'Hour', 'Air Temp', 'Dew Point Temp', 'Sea Level Pressure',
           'Wind Direction', 'Wind Speed Rate',
           'Sky Condition Total Coverage Code',
           'Liquid Precipitation Depth Dimension - 1Hr Duration',
           'Liquid Precipitation Depth Dimension - Six Hour Duration']
weatherData = pd.read_csv(filepath, delim_whitespace=True,
                          names=headers)
weatherData.loc[:, 'Air Temp'] = (weatherData['Air Temp']/10) * 1.8 + 32
weatherData.head(2)

,Year,Month,Day,Hour,Air Temp,Dew Point Temp,Sea Level Pressure,Wind Direction,Wind Speed Rate,Sky Condition Total Coverage Code,Liquid Precipitation Depth Dimension - 1Hr Duration,Liquid Precipitation Depth Dimension - Six Hour Duration
0,2001,1,1,0,30.92,-94,10146,280,57,2,0,-9999
1,2001,1,1,1,30.02,-94,10153,280,57,4,0,-9999

#### Use .groupby() to group the data by the month

In [3]:
monthGroups = weatherData.groupby(by='Month')

In [4]:
type(monthGroups)

pandas.core.groupby.groupby.DataFrameGroupBy

#### Let's explore our groupby object using the .groups attribute and the .size() method.
The .groups attribute will list the name of each group and the row index values that make up each group.

The .size() method will print the size of each group

In [5]:
monthGroups.groups

{1: Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
             ...
             734, 735, 736, 737, 738, 739, 740, 741, 742, 743],
            dtype='int64', length=744),
 2: Int64Index([ 744,  745,  746,  747,  748,  749,  750,  751,  752,  753,
             ...
             1406, 1407, 1408, 1409, 1410, 1411, 1412, 1413, 1414, 1415],
            dtype='int64', length=672),
 3: Int64Index([1416, 1417, 1418, 1419, 1420, 1421, 1422, 1423, 1424, 1425,
             ...
             2150, 2151, 2152, 2153, 2154, 2155, 2156, 2157, 2158, 2159],
            dtype='int64', length=744),
 4: Int64Index([2160, 2161, 2162, 2163, 2164, 2165, 2166, 2167, 2168, 2169,
             ...
             2870, 2871, 2872, 2873, 2874, 2875, 2876, 2877, 2878, 2879],
            dtype='int64', length=720),
 5: Int64Index([2880, 2881, 2882, 2883, 2884, 2885, 2886, 2887, 2888, 2889,
             ...
             3614, 3615, 3616, 3617, 3618, 3619, 3620, 3621, 3622, 3623],
            dtype='int64', length=744),
 6: Int64Index([3624, 3625, 3626, 3627, 3628, 3629, 3630, 3631, 3632, 3633,
             ...
             4334, 4335, 4336, 4337, 4338, 4339, 4340, 4341, 4342, 4343],
            dtype='int64', length=720),
 7: Int64Index([4344, 4345, 4346, 4347, 4348, 4349, 4350, 4351, 4352, 4353,
             ...
             5078, 5079, 5080, 5081, 5082, 5083, 5084, 5085, 5086, 5087],
            dtype='int64', length=744),
 8: Int64Index([5088, 5089, 5090, 5091, 5092, 5093, 5094, 5095, 5096, 5097,
             ...
             5822, 5823, 5824, 5825, 5826, 5827, 5828, 5829, 5830, 5831],
            dtype='int64', length=744),
 9: Int64Index([5832, 5833, 5834, 5835, 5836, 5837, 5838, 5839, 5840, 5841,
             ...
             6542, 6543, 6544, 6545, 6546, 6547, 6548, 6549, 6550, 6551],
            dtype='int64', length=720),
 10: Int64Index([6552, 6553, 6554, 6555, 6556, 6557, 6558, 6559, 6560, 6561,
             ...
             7286, 7287, 7288, 7289, 7290, 7291, 7292, 7293, 7294, 7295],
            dtype='int64', length=744),
 11: Int64Index([7296, 7297, 7298, 7299, 7300, 7301, 7302, 7303, 7304, 7305,
             ...
             8004, 8005, 8006, 8007, 8008, 8009, 8010, 8011, 8012, 8013],
            dtype='int64', length=718),
 12: Int64Index([8014, 8015, 8016, 8017, 8018, 8019, 8020, 8021, 8022, 8023,
             ...
             8748, 8749, 8750, 8751, 8752, 8753, 8754, 8755, 8756, 8757],
            dtype='int64', length=744)}

In [6]:
# it's not surprising that the February group has a smaller size since there
# are less days in February
monthGroups.size()

Month
1     744
2     672
3     744
4     720
5     744
6     720
7     744
8     744
9     720
10    744
11    718
12    744
dtype: int64

In [7]:
monthGroups['Air Temp'].describe()

       count       mean        std      min    25%    50%    75%     max
Month
1      744.0  32.598790   6.414316    16.88  28.04  33.08  37.04   55.94
2      672.0  34.797232  70.133895 -1767.82  32.00  37.94  42.98   60.98
3      744.0  40.881210   6.699112    23.00  35.96  42.08  44.96   57.02
4      720.0  54.581500  10.520313    33.08  46.94  51.98  62.06   87.08
5      744.0  64.435806   8.740440    44.96  59.00  62.06  69.98   89.96
6      720.0  74.812750   7.926133    51.98  69.98  73.94  80.06   93.92
7      744.0  75.186452   7.108172    57.92  69.98  75.02  80.06   93.02
8      744.0  79.069516   6.782238    64.04  73.94  78.08  84.02  100.04
9      720.0  68.319000   8.468815    48.92  62.96  69.08  75.02   84.92
10     744.0  58.796048  10.290392    37.04  51.08  57.92  66.92   82.04
11     718.0  52.939164   9.046250    30.92  46.94  53.06  59.00   75.92
12     744.0  44.056613  10.457353    21.02  35.96  44.06  51.08   71.96

#### Getting groups using the .get_group() method
We can get a specific group by using the .get_group method. We just need to pass the name of the group which will be one of the values that we grouped by. See the example below

In [ ]:
# To get the March group we do the following:
marchData = monthGroups.get_group(3)
marchData.head(3)

### In Class Exercise
Create a new goupby object (something other than grouping by month). Explore it using the methods above.

In [9]:
hourGroups=weatherData.groupby('Hour')

In [12]:
hourGroups['Wind Speed Rate'].describe()

      count       mean         std     min   25%   50%   75%    max
Hour
0     365.0  41.884932   19.099880     0.0  31.0  41.0  52.0  118.0
1     365.0  40.090411   20.374382     0.0  26.0  36.0  52.0  170.0
2     365.0  37.600000   20.545554     0.0  26.0  36.0  46.0  124.0
3     365.0  35.331507   19.972707     0.0  21.0  31.0  46.0  103.0
4     365.0  33.602740   18.926506     0.0  21.0  31.0  41.0   98.0
5     365.0  33.084932   20.046811     0.0  21.0  31.0  41.0  108.0
6     365.0  32.290411   20.335862     0.0  21.0  31.0  41.0  108.0
7     365.0  31.369863   19.662473     0.0  21.0  31.0  41.0  103.0
8     365.0   4.293151  525.416950 -9999.0  21.0  31.0  41.0  103.0
9     365.0  31.589041   20.465487     0.0  21.0  31.0  41.0  103.0
10    365.0  30.958904   21.168891     0.0  15.0  31.0  41.0  108.0
11    365.0   6.117808  525.545394 -9999.0  21.0  31.0  46.0  118.0
12    365.0  34.860274   21.234036     0.0  21.0  31.0  46.0  129.0
13    365.0  38.227397   20.960987     0.0  26.0  36.0  52.0  103.0
14    364.0  41.925824   22.601043     0.0  26.0  41.0  57.0  124.0
15    365.0  44.054795   23.250364     0.0  31.0  41.0  57.0  129.0
16    365.0  45.008219   22.911138     0.0  31.0  41.0  57.0  113.0
17    364.0  48.565934   24.261058     0.0  31.0  46.0  62.0  134.0
18    365.0  24.605479  526.668133 -9999.0  36.0  52.0  67.0  139.0
19    365.0  52.515068   23.325761     0.0  36.0  52.0  62.0  129.0
20    365.0  51.345205   23.494359     0.0  36.0  52.0  67.0  129.0
21    365.0  51.027397   22.177959     0.0  36.0  52.0  67.0  118.0
22    365.0  49.186301   22.029783     0.0  36.0  46.0  62.0  139.0
23    365.0  45.515068   19.467017     0.0  36.0  46.0  57.0  118.0

# Calculating Simple Statistics on Groups

#### Now let's use the .mean(), .min(), and .max() methods on the groupby object to find the mean, min, and max air temperature of each month.

Note that operating on a groupby will return a DataFrame or Series depending on what the operation is.

In [13]:
monthlyMeanTemps = monthGroups['Air Temp'].mean()
print(type(monthlyMeanTemps))
monthlyMeanTemps

<class 'pandas.core.series.Series'>

Month
1     32.598790
2     34.797232
3     40.881210
4     54.581500
5     64.435806
6     74.812750
7     75.186452
8     79.069516
9     68.319000
10    58.796048
11    52.939164
12    44.056613
Name: Air Temp, dtype: float64

In [ ]:
monthGroups['Air Temp'].max()

In [ ]:
monthGroups['Air Temp'].min()

#### We found a missing value! As a review, let's use some of what we have learned to take a closer look and fix it!

First let's use .loc[] and boolean series to find all values less than 10 (which is already 6 degrees lower than the minimum temp in January). The reason we do this is that I want to see if there are any other bad data points.

In [16]:
weatherData.loc[weatherData['Air Temp'] < 10, :]

,Year,Month,Day,Hour,Air Temp,Dew Point Temp,Sea Level Pressure,Wind Direction,Wind Speed Rate,Sky Condition Total Coverage Code,Liquid Precipitation Depth Dimension - 1Hr Duration,Liquid Precipitation Depth Dimension - Six Hour Duration
1352,2001,2,26,8,-1767.82,-9999,10130,230,26,0,0,-9999

#### Let's replace it with the a linear interpolation between hour 7 and hour 9..
There are a few ways we can do this. For now, I am just going to use the .loc method to grab the rows corresponding to 2001-2-26 hours 7 and 9.

As a review, I will do this in a few steps:
* First I will use .loc to get the appropriate rows.
* Then, I will use .loc to get the rows for only the 'Air Temp' column
* Then, I will use the .mean() to get the mean value (same as a basic linear interpolation) all in one line.

In [17]:
weatherData.loc[(weatherData['Month'] == 2) & (weatherData['Day'] == 26) &
                (weatherData['Hour'].isin([7, 9])), :]

,Year,Month,Day,Hour,Air Temp,Dew Point Temp,Sea Level Pressure,Wind Direction,Wind Speed Rate,Sky Condition Total Coverage Code,Liquid Precipitation Depth Dimension - 1Hr Duration,Liquid Precipitation Depth Dimension - Six Hour Duration
1351,2001,2,26,7,50.0,90,10124,240,31,4,0,-9999
1353,2001,2,26,9,48.2,75,10136,310,46,0,0,-9999

In [18]:
weatherData.loc[(weatherData['Month'] == 2) & (weatherData['Day'] == 26) &
                (weatherData['Hour'].isin([7, 9])), 'Air Temp']

1351    50.0
1353    48.2
Name: Air Temp, dtype: float64

In [19]:
weatherData.loc[(weatherData['Month'] == 2) & (weatherData['Day'] == 26) &
                (weatherData['Hour'].isin([7, 9])), 'Air Temp'].mean()

49.1

#### Let's fill the bad value with this estimated value, using the .loc method.
Note that the row label of the row with the bad value is 1352. We will use that. Remember this is not the only way, this is just one way.

Note that the '\' allows me to continue the line of code on the next line. I will explain in lecture.

Also note that you must spell your columns names correctly - or you may accidentally add a new column!

In [20]:
weatherData.loc[1352, 'Air Temp'] = \
    weatherData.loc[(weatherData['Month'] == 2) & (weatherData['Day'] == 26) &
                    (weatherData['Hour'].isin([7, 9])), 'Air Temp'].mean()

#### Finally, find the minimum temps of each month.

In [21]:
monthGroups['Air Temp'].min()

Month
1     16.88
2     19.94
3     23.00
4     33.08
5     44.96
6     51.98
7     57.92
8     64.04
9     48.92
10    37.04
11    30.92
12    21.02
Name: Air Temp, dtype: float64

# Using the .agg() method on a groupby objects
We can use the .agg() (short for aggregate) method on a group by object to calculate multiple statistics. Let's use the monthGroups object we have already created.

Docs are here: <https://pandas.pydata.org/pandas-docs/stable/generated/pandas.core.groupby.DataFrameGroupBy.agg.html>

In [22]:
monthGroups['Air Temp'].agg(['min', 'mean', 'max', 'std'])

         min       mean     max        std
Month
1      16.88  32.598790   55.94   6.414316
2      19.94  37.500982   60.98   8.311494
3      23.00  40.881210   57.02   6.699112
4      33.08  54.581500   87.08  10.520313
5      44.96  64.435806   89.96   8.740440
6      51.98  74.812750   93.92   7.926133
7      57.92  75.186452   93.02   7.108172
8      64.04  79.069516  100.04   6.782238
9      48.92  68.319000   84.92   8.468815
10     37.04  58.796048   82.04  10.290392
11     30.92  52.939164   75.92   9.046250
12     21.02  44.056613   71.96  10.457353

#### Other strings that pandas will recognize as functions are here:
<http://pandas.pydata.org/pandas-docs/stable/basics.html>

#### Using .agg to compute different statistics on different columns:

In [23]:
monthGroups.agg({'Air Temp': 'mean', 'Wind Speed Rate': 'max'})

        Air Temp  Wind Speed Rate
Month
1      32.598790              139
2      37.500982              129
3      40.881210              139
4      54.581500              170
5      64.435806              103
6      74.812750              103
7      75.186452               98
8      79.069516               82
9      68.319000              118
10     58.796048              129
11     52.939164              124
12     44.056613              134

#### Using .agg to compute different statistics on different columns, and renaming the columns:

In [24]:
(monthGroups.agg({'Air Temp': 'mean', 'Wind Speed Rate': 'max'}).
 rename(columns={'Air Temp': 'Mean Air Temp', 'Wind Speed Rate': 'Max Wind Speed Rate'}))

       Mean Air Temp  Max Wind Speed Rate
Month
1          32.598790                  139
2          37.500982                  129
3          40.881210                  139
4          54.581500                  170
5          64.435806                  103
6          74.812750                  103
7          75.186452                   98
8          79.069516                   82
9          68.319000                  118
10         58.796048                  129
11         52.939164                  124
12         44.056613                  134

### In Class Exercise
Create a new goupby object (something other than grouping by month). Use the .agg function to calculate various statistics on the groupby object.

# Using the apply method for custom analysis
The apply method allows us to apply a custom function to each group.

#### Finding the percentage of hourly temperature below 32
We can use the apply method to help us find the percentage of hourly temps that are below 32 in each month. First we need to define the function we will use.

In [26]:
def prctTempsBelow32(x, y=32):
    # x is a series of hourly Air Temp values. All we need to do is test if
    # each value is less than 32. This will create a series of boolean values,
    # a value will be True if the temp is less than 32, and False if not.
    # Finding the mean of this boolean series gives us the percentage of hours
    # that are less than 32 (because True has a value of 1, and False a value
    # of 0)
    
    # The below code is great, but we could also do it all on one line:
    # return (x < 32).mean()
    
    tempLessThan32 = (x < y).mean()
    
    return tempLessThan32

In [27]:
monthGroups['Air Temp'].apply(prctTempsBelow32) * 100

Month
1     42.473118
2     21.875000
3      7.795699
4      0.000000
5      0.000000
6      0.000000
7      0.000000
8      0.000000
9      0.000000
10     0.000000
11     0.278552
12    13.037634
Name: Air Temp, dtype: float64

#### What if we want the odds of any day in the month having at least one or more hourly temps below 32?

In [28]:
def prctDayBelow32(x):
    # x is now a dataframe with rows only corresponding to a specific month
    # we will group this data by the day of the month
    dayGroups = x.groupby(by='Day')
    # now, we just need to test if the min temp on each day is below 32. If 
    # this is true, then we know that at least one hours is below 32
    daysLessThan32 = (dayGroups['Air Temp'].min() < 32)
    # daysLessThan32 is no a boolean series that is True if the days min temp
    # is less than 32, and false if not. Findinging the mean of this gives us
    # the percentages of days less than 32
    
    # This code works, but we could also do it all on one line:
    # return (x.groupby(by='Day')['Air Temp'].min() < 32).mean()
    return daysLessThan32.mean()

In [29]:
monthGroups.apply(prctDayBelow32) * 100

Month
1     83.870968
2     35.714286
3     29.032258
4      0.000000
5      0.000000
6      0.000000
7      0.000000
8      0.000000
9      0.000000
10     0.000000
11     6.666667
12    29.032258
dtype: float64

#### Quick Review of Lambda Functions
A lambda function is a function that we define _in line_ that does not have a name. (In other programming languages these are sometimes called anonymous functions). For example,
instead of using the prctTempBelow32 function above we could just pass a lambda function to the apply method:

In [ ]:
monthGroups['Air Temp'].apply(lambda x: (x < 32).mean()) * 100

### In Class Exercise
Create a cell below and explore the monthGroups groupby object witha function that you define (you can define a function or use a lambda function)

# Repeating The Same Analysis Using a Datetime Column

#### You can also use groupby on a datetime column, you just need to pass the datetime column itself to the groupby method:

First I am going to reload the data using the parse_dates argument to convert the first 4 columns to a datetime, and convert the 'Air Temp' column to Fahrenheit.

In [30]:
weatherData = pd.read_csv(filepath, delim_whitespace=True,
                          names=headers, parse_dates=[[0, 1, 2, 3]])
weatherData.loc[:, 'Air Temp'] = (weatherData['Air Temp']/10) * 1.8 + 32
weatherData.head(2)

,Year_Month_Day_Hour,Air Temp,Dew Point Temp,Sea Level Pressure,Wind Direction,Wind Speed Rate,Sky Condition Total Coverage Code,Liquid Precipitation Depth Dimension - 1Hr Duration,Liquid Precipitation Depth Dimension - Six Hour Duration
0,2001-01-01 00:00:00,30.92,-94,10146,280,57,2,0,-9999
1,2001-01-01 01:00:00,30.02,-94,10153,280,57,4,0,-9999

#### Below, note how I pass the datetime column, using .dt.month to get the month of each value in the column
So, really, I am passing a series of month values

In [31]:
weatherData.groupby(by=weatherData['Year_Month_Day_Hour'].dt.month)['Air Temp'].mean()

Year_Month_Day_Hour
1     32.598790
2     34.797232
3     40.881210
4     54.581500
5     64.435806
6     74.812750
7     75.186452
8     79.069516
9     68.319000
10    58.796048
11    52.939164
12    44.056613
Name: Air Temp, dtype: float64

## More Groupby Examples On Our Labor Sheet Data
The labor sheet is a great use case for groupby! Naturally, we may want to compare manager performance. Let's use groupy and some analysis to do!

First, we will load the dataset, just like we have before.

In [32]:
filepath = os.path.join(os.getcwd(), 'data', 'LaborSheetData.csv')
laborSheetData = pd.read_csv(filepath, parse_dates=[[2, 3], 13])
laborSheetData.head()

,Date_Hour,Store,Manager,Projected Sales,Sales,DT TTL,KVS Total,Hrs +/- (Actual vs Need),Accum Hrs +/- (Act vs Need),Reason for +/- Labor,Reason for High TTL's,Manager Entering Data,TimeStamp
0,2017-02-04 07:00:00,4007,Monica H,281.0,296.0,192,117,-1.00,1.00,NaN,NaN,NaN,2017-02-04 07:10:00
1,2017-02-04 08:00:00,4007,David H,670.0,347.0,111,97,2.39,2.39,NaN,NaN,NaN,2017-02-04 08:04:00
2,2017-02-03 09:00:00,4007,David H,784.0,649.0,143,73,0.18,0.18,NaN,NaN,NaN,2017-02-03 18:41:00
3,2017-02-04 10:00:00,4007,David H,852.0,750.0,158,85,0.75,3.25,NaN,NaN,NaN,2017-02-04 10:06:00
4,2017-02-05 05:00:00,4007,Zoey D,54.0,108.0,104,45,-1.50,-1.50,NaN,NaN,NaN,2017-02-05 10:57:00

#### Let's group the laborsheet data by the managers

In [33]:
managerGroups = laborSheetData.groupby('Manager')
# let's print the size of the groups just to get an idea of what we are working with.
managerGroups.size()

Manager
Anna B         147
Ariel A        282
Blaine O       289
Brittany S      28
Caitlin H      354
Carmella R     522
Ceaunna S      649
Charizma M      53
Charles S      193
Christina S    594
Claudia A       96
Connie G        13
Dacota A       318
Daisy D        114
David H         48
Deanna G        13
DeeDee G        19
Echo R         156
Emily P        545
Erica F        444
Erin S         784
Greg D          20
Heather W      171
Jammie T       432
Jenna J        120
Jessica B      668
Jessica M      340
Jesus B        343
Jillian A      199
Jordan W       339
Jose M         268
Josh D         281
Kyllie T       578
Lynn W          33
Melissa J      427
Michelle M     572
Monica H       275
Nichole S        5
Olivia P       422
Ora M          189
Rachel H       242
Sabrina D      169
Sarah U        193
Shannon H      179
Tabby W        360
Tom W          518
Trish G         30
Veronica C     100
Zoey D          41
dtype: int64

#### Let's find the manager with the best mean DT TTL (drive through times)
To do this, we will use .mean() and then we will use .sort_values() to sort from the smallest DT TTL (fastest time) to the longest time.

In [34]:
managerGroups['DT TTL'].mean().sort_values()

Manager
Brittany S      85.750000
Daisy D        115.087719
Dacota A       130.647799
Jessica M      130.861765
Sabrina D      131.674556
Trish G        132.366667
Connie G       133.923077
Erin S         137.911990
Ora M          143.216931
Erica F        156.313063
Jose M         157.347015
Deanna G       158.307692
Michelle M     158.741259
Jordan W       165.032448
Shannon H      166.664804
Zoey D         167.121951
Monica H       168.454545
Ariel A        170.315603
Caitlin H      173.347458
Melissa J      175.124122
Lynn W         179.212121
Tom W          184.065637
David H        184.187500
Nichole S      185.000000
Anna B         190.748299
Charizma M     192.150943
Jesus B        193.008746
Emily P        194.708257
Kyllie T       196.743945
Carmella R     197.503831
Claudia A      199.645833
Veronica C     201.170000
Ceaunna S      202.317411
Sarah U        202.626943
Olivia P       204.398104
Jessica B      208.561377
Blaine O       211.249135
DeeDee G       211.894737
Jenna J        213.625000
Josh D         217.149466
Christina S    219.303030
Charles S      219.424870
Jammie T       220.569444
Rachel H       225.041322
Heather W      226.368421
Echo R         229.871795
Jillian A      233.944724
Tabby W        234.136111
Greg D         274.450000
Name: DT TTL, dtype: float64

#### This is great, but we question Brittany S's time - I wonder how many hours she has worked?
Let's take into account the sample size by also finding the count of values for each manager. We need to use agg() for this. Aso, since the results have more than one column, we need to pass the name of the column that we want to sort by to the sort_values() method.

In [ ]:
managerDTTTL = (managerGroups['DT TTL'].agg(['mean', 'count']).
                sort_values('mean').rename(columns={'mean': 'Mean DT TTL',
                                                     'count': 'Sample Size'}))
print(managerDTTTL)

#### Let's filter out managers with a sample size less than 100.

In [ ]:
managerDTTTL.loc[managerDTTTL['Sample Size'] > 100, :].sort_values(by='Mean DT TTL')

#### Let's investigate the relationship between DT TTLs and the hour of the day.

In [ ]:
hourGroups = laborSheetData.groupby(laborSheetData['Date_Hour'].dt.hour)

In [ ]:
hourGroupDTTTLs = hourGroups['DT TTL'].agg(['mean', 'count'])
print(hourGroupDTTTLs)

#### What if we express manager DT TTLs in terms of deviations from the mean?
To do this we need to subtract the mean DT TTL for each of the recorded DT TTL values.
There are multiple ways to do this - we will show one way below.

#### Introducing the .to_dict() method to extract values from a dataframe to a dictionary.
Dictionaries are fast data structures - that are liberally used in python.

In [ ]:
meanHourDTTTLs = hourGroupDTTTLs['mean'].to_dict()
print(meanHourDTTTLs)

#### Now we loop through the dictionary and then subtract the mean from the appropriate rows in the dataframe:

In [ ]:
for hour in meanHourDTTTLs:
    laborSheetData.loc[laborSheetData['Date_Hour'].dt.hour == hour, 'DT TTL'] = \
    laborSheetData.loc[laborSheetData['Date_Hour'].dt.hour == hour, 'DT TTL'] - meanHourDTTTLs[hour]

In [ ]:
laborSheetData.head()

#### Now we use recalculate the mean DT TTLs, using the same groupby object!
Since we did not update anything in the managers column, we do not need to create a new groupby object!

In [ ]:
(managerGroups['DT TTL'].agg(['mean', 'count']).
                sort_values('mean').rename(columns={'mean': 'Mean DT TTL Deviations',
                                                     'count': 'Sample Size'}))

#### Let's now assign the output to a variable (a new dataframe) which we can then filter by the sample size

In [ ]:
managerDTTTLDev = (managerGroups['DT TTL'].agg(['mean', 'count']).
                sort_values('mean').rename(columns={'mean': 'Mean DT TTL Deviations',
                                                     'count': 'Sample Size'}))

In [ ]:
managerDTTTLDev.loc[managerDTTTLDev.loc[:, 'Sample Size'] > 100, :].sort_values(by='Mean DT TTL Deviations')

### In Class Exercise
Create some cells below to explore the laborSheetData, you can create a new groupby object and explore it as you wish.

## Question or Comments About This Notebook?
Feel free to contact me via my LinkedIn: https://www.linkedin.com/in/william-j-henry <br>
You can also email me at will@henryanalytics.com <br>